import {
  AboutTeaserProps,
  Button,
  HeroProps,
  MissionProps,
  QuickServicesProps,
} from "@/ui";
import Icon from "../Icon";

export const dataHero: HeroProps = {
  title: "Александрова Дача",
  backgroundImage: { src: "/images/home-img1.jpg", alt: "desc" },
  subtitle: "конно-спортивный клуб",
  description:
    "Проведите незабываемый день на нашей конюшне: познакомьтесь с животными, прокатитесь верхом и насладитесь природой.",
  cta: <Button variant="primary">Записаться на прогулку</Button>,
};

export const itemsServices: QuickServicesProps["items"] = [
  {
    id: "riding",
    title: "Верховая езда для взрослых и детей",
    description:
      "Для любого возраста и уровня подготовки. Прогулки, обучение, спорт.",
    href: "/services/rides/tours",
    icon: <Icon pathImage="/icons/ridding.ico" />,
  },
  {
    id: "farm",
    title: "Контактная мини-ферма",
    description:
      "Верблюд, северные олени, козочки, овечки и другие дружелюбные животные.",
    href: "/services/farm",
    icon: <Icon pathImage="/icons/farm.ico" />,
  },
  {
    id: "rental",
    title: "Аренда экипажей и животных",
    description:
      "На массовые мероприятия, праздники, свадьбу или для фотосессии.",
    href: "/rental",
    icon: <Icon pathImage="/icons/rent.ico" />,
  },
  {
    id: "breeding",
    title: "Разведение и продажа",
    description:
      "Племенное разведение. Продажа лошадей и пони. Жеребцы на случку. ",
    href: "/breeding",
    icon: <Icon pathImage="/icons/sale.ico" />,
  },
];

export const news: AboutTeaserProps[] = [
  {
    title: "Зимние услуги",
    text: [
      "❄ Аренда животных на Новогодние мероприятия",
      "🌲Фотосессии",
      "❄ Поздравление Деда Мороза с катанием на лошадях, пони и северных оленях",
      "🌲 Катания на русской тройке (лошади или пони)",
      "❄ Аренда саней, карет и тележек, запряжённых лошадьми, пони или северным оленем",
    ],
    gallerySection: {
      items: [
        { src: "/images/gallery/new-year1.jpg", alt: "Gallery Image 1" },
        { src: "/images/gallery/new-year2.jpg", alt: "Gallery Image 2" },
        { src: "/images/gallery/new-year3.jpg", alt: "Gallery Image 3" },
      ],
      position: "start",
    },
  },
];

export const dataMission: MissionProps = {
  title: "Наши преимущества",
  points: [
    {
      heading: "Лошади под любого всадника",
      text: "В хозяйстве содержатся более 150 лошадей и пони. Поможем подобрать для верховой езды именно Вашу лошадь (пони) - нужного роста, опыта и темперамента.",
    },
    {
      heading: "Работаем в любую погоду",
      text: "На территории клуба имеются открытый и крытый манежи, а также выход в парк. Катания и занятия проводятся ежедневно, без выходных, в любую погоду.",
    },
    {
      heading: "Комфортные условия",
      text: "Для наших гостей имеется бесплатная парковка на территории клуба, теплая раздевалка, шкафчики и уютное кафе.",
    },
  ],
  colorVariant: "f0e7cf",
};
