import { MissionProps, QuickServicesProps } from "@/ui";
import Icon from "../Icon";

export const itemsServices: QuickServicesProps["items"] = [
  {
    id: "riding",
    title: "Верховая езда",
    description: "Для любого уровня подготовки",
    href: "/riding",
    icon: <Icon pathImage="/icons/ridding.ico" />,
  },
  {
    id: "zoo",
    title: "Мини-зоопарк",
    description: "Верблюж, козочки, овечки и другие дружелюбные животные.",
    href: "/zoo",
    icon: <Icon pathImage="/icons/farm.ico" />,
  },
  {
    id: "rent",
    title: "Аренда экипажей и животных",
    description:
      "На массовые мероприятия, праздники, свадьбу или для фотосессии",
    href: "/rent",
    icon: <Icon pathImage="/icons/rent.ico" />,
  },
  {
    id: "sale",
    title: "Разведение и продажа",
    description: "Продажа лошадей и пони. ",
    href: "/sale",
    icon: <Icon pathImage="/icons/sale.ico" />,
  },
];

export const itemsGallery = [
  { src: "/images/gallery/new-year1.jpg", alt: "Gallery Image 1" },
  { src: "/images/gallery/new-year2.jpg", alt: "Gallery Image 2" },
  { src: "/images/gallery/new-year3.jpg", alt: "Gallery Image 3" },
];

export const dataText = [
  "💥 Аренда животных на Новогодние мероприятия",
  "💥 Фотосессии",
  "💥 Поздравление Деда Мороза с катанием на лошадях, пони и северных оленях",
  "💥 Катания на русской тройке (лошади или пони)",
  "💥 Аренда саней, карет и тележек, запряжённых лошадьми, пони или северным оленем",
];

export const dataMission: MissionProps = {
  title: "Наши преимущества",
  points: [
    {
      heading: "Лошади под любого всадника",
      text: "В хозяйстве содержатся более 150 лошадей и пони. Поможем подобрать для верховой езды именно Вашу лошадь (пони) - нужного роста, опыта и темперамента.",
    },
    {
      heading: "Работаем в любую погоду",
      text: "На территории клуба имеются открытый и крытый манежи, а также выход в парк. Катания и занятия проводятся ежедневно, без выходных, в любую погоду.",
    },
    {
      heading: "Комфортные условия",
      text: "Для наших гостей имеется бесплатная парковка на территории клуба, теплая раздевалка, шкафчики и уютное кафе.",
    },
  ],
};
