export default function HorseRiding() {
  return (
    <div className="w-7xl">
      <h1 className="text-5xl mb-2.5">О нас</h1>
      <p className="mb-2.5">
        Царскосельский конно-спортивный клуб Александрова Дача (бывший КСК
        Генетика) основан в 2001 году и на сегодняшний день является одним из
        самых известных и крупных конных клубов Санкт-Петербурга и Ленинградской
        области. Особой популярностью клуб пользуется у жителей Пушкина,
        Павловска и ближайших районов.
      </p>
      <p className="mb-2.5">
        Верховая езда – это увлекательный вид активного отдыха. В нашем клубе Вы
        сможете пройти обучение или просто покататься на лошади или пони. Клуб
        Александрова Дача рассчитан на посетителей всех возрастов. Широкий выбор
        лошадей и пони различных пород (от маленьких пони до 100 см в холке до
        мощных тяжеловозов 175 см и выше) позволяет подобрать партнера под
        любого всадника.
      </p>
      <p className="mb-2.5">
        Желающим серьезно заниматься конным спортом КСК Александрова дача
        предлагает подготовку к участию в соревнованиях по конкуру и выездке,
        сдаче на спортивный разряд. Есть возможность заниматься в группах или
        индивидуально. Для достижения более высоких результатов можно взять в
        аренду лошадь или пони.
      </p>
      <p className="mb-2.5">
        Наш клуб профессионально занимается разведением и продажей лошадей и
        пони, насчитывает около 150 голов различных пород (шетлендские и
        уэльские пони, тяжеловозы, ганноверы, буденновцы и другие спортивные
        породы). Многие из них принимают участие в выставках, являются
        чемпионами пород, имеют дипломы. Также предлагаются к случке
        жеребцы-производители.
      </p>
      <p className="mb-2.5">
        Также на территории клуба в контактном мини-зоопарке содержатся
        верблюды, северные олени, лама, коровы, козы, барашки, енот, птицы,
        кролики и другие животные. Наши питомцы пользуются огромным спросом для
        проведения фотосессий, катаний, праздников. К Вашим услугам шикарные
        кареты и экипажи, которые украсят Вашу свадьбу, детский праздник,
        новогодний корпоратив и т.д.
      </p>
      <p className="mb-2.5">
        Частным владельцам мы предлагаем постой в нашей конюшне. Для Вас и Ваших
        лошадей мы создали все необходимые условия: денники, левады для выгула,
        ветеринарная аптека, конный магазин, крытый и открытый манежи, конкурный
        набор препятствий.
      </p>
      <p className="mb-2.5">
        Все наши клиенты и гости могут воспользоваться парковкой на территории
        клуба, раздевалкой, шкафчиком.
      </p>
      <p className="mb-2.5">
        В здании администрации работает кафе. Каждый день для Вас вкуснейшие
        блинчики и сырники, супы и салаты по доступным ценам. Всегда в продаже
        свежие фермерские продукты из коровьего и козьего молока, куриные и
        перепелиные яйца.
      </p>
      <p className="mb-2.5">Наш клуб работает ежедневно с 10:00 до 19:30</p>
    </div>
  );
}
