import { HorseServiceOutDto } from "@/types";

export const services: HorseServiceOutDto[] = [
    {
        id: "aeddfd29-deb2-4a1b-beb6-9316602eb844",
        slug: "for-sale",
        name: "Продается",
        description: "Лошади, которые доступны для продажи. У нас есть широкий выбор лошадей различных пород и возрастов, готовых стать частью вашей семьи. Каждая лошадь проходит тщательный отбор и заботу, чтобы обеспечить вам качественного питомца. Свяжитесь с нами, чтобы узнать больше о наших лошадях, доступных для продажи, и найти идеального компаньона для вас.",
        price: 50000,
        created_at: "2024-06-01T12:00:00Z",
        updated_at: "2024-06-01T12:00:00Z",
    },
    {
        id: "aeddfd29-deb2-4a1b-beb6-9316602jb844",
        slug: "for-breeding",
        name: "Предлагается к случке",
        description: "Наши жеребцы доступны для случки, предлагая высококачественные генетические линии для разведения. Мы гордимся тем, что предоставляем нашим клиентам доступ к лучшим жеребцам, которые могут помочь улучшить качество и характеристики будущих поколений лошадей. Свяжитесь с нами, чтобы узнать больше о наших жеребцах, доступных для случки, и обсудить возможности сотрудничества.",
        price: 5000,
        created_at: "2024-06-01T12:00:00Z",
        updated_at: "2024-06-01T12:00:00Z",
    }
];