import { ServiceGroup } from "@/types/ServicesType";

const services_bd: ServiceGroup = [
  {
    id: "riding",
    groupName: "Конные прогулки",
    services: [
      {
        name: "Разовое катание на лошади (пони)",
        description:
          "В поводу по манежу или парку. Не более 3-х всадников на одного тренера.",
        image: "/images/services/riding1.jpg",
        subname: [
          {
            name: "Будние дни",
            subname: [
              { name: "30 минут", price: 1500 },
              { name: "1 час", price: 2000 },
            ],
          },
          {
            name: "Выходные дни",
            subname: [
              { name: "30 минут", price: 1500 },
              { name: "1 час", price: 2000 },
            ],
          },
        ],
        stickers: [
          "При предварительной записи скидка 200 руб.",
          "Для всадников без опыта",
        ],
      },
      {
        name: "Индивидуальное катание на лошади (пони)",
        description: "В поводу по манежу или парку. Все внимание только Вам.",
        image: "/images/services/riding2.jpg",
        subname: [
          {
            name: "Будние дни",
            subname: [
              { name: "30 минут", price: 1500 },
              { name: "1 час", price: 2000 },
            ],
          },
          {
            name: "Выходные дни",
            subname: [
              { name: "30 минут", price: 1500 },
              { name: "1 час", price: 2000 },
            ],
          },
        ],
        stickers: [
          "При предварительной записи скидка 200 руб.",
          "Для всадников без опыта",
        ],
      },
      {
        name: "Конная прогулка в полях",
        description: "Не менее 2-х всадников. Шаг, рысь, галоп (по готовности)",
        image: "/images/services/riding3.jpg",
        subname: [
          { name: "1 час", price: 2500 },
          { name: "2 часа", price: 3000 },
        ],
        stickers: [
          "Только по предварительной записи",
          "Для начинающих и опытных всадников",
        ],
      },
      {
        name: "Конная прогулка в полях",
        description:
          "Не менее 2-х всадников. Шаг, рысь, галоп, преодоление канав и водных препятствий",
        image: "/images/services/riding4.jpg",
        subname: [{ name: "3 часа", price: 5000 }],
        stickers: [
          "Только по предварительной записи",
          "Для всадников, уверенно сидящих в седле.",
        ],
      },
      {
        name: "Выезд на финский залив",
        description:
          "Прогулка, купание, фотосессия. В стоимость входит аренда и доставка лошади, услуги инструктора.",
        image: "/images/services/riding5.jpg",
        subname: [
          { name: "одна лошадь", price: 15000 },
          { name: "дополнительная лошадь", price: 5000 },
        ],
        stickers: [
          "Только по предварительной записи",
          "Для всадников любого уровня подготовки.",
        ],
      },
    ],
  },
  {
    id: "learning-riding",
    groupName: "Обучение верховой езде",
    services: [
      {
        name: "Разовое занятие с прогулкой на лошади (пони)",
        description:
          "Обучение посадке, управлению на шагу / рыси – 30 мин. Прогулка по манежу или парку – 30 мин. Не более 3-х всадников на одного тренера.",
        image: "/images/services/learning-riding1.jpg",
        subname: [
          { name: "Будние дни", price: 2000 },
          { name: "Выходные дни", price: 2000 },
        ],
        stickers: [
          "При предварительной записи скидка 200 руб.",
          "Для всадников без опыта",
        ],
      },
      {
        name: "Разовое занятие на лошади (пони)",
        description:
          "Обучение посадке, управлению на шагу / рыси / галопе. Не более 3-х всадников на одного тренера.",
        image: "/images/services/learning-riding2.jpg",
        subname: [
          {
            name: "Будние дни",
            subname: [
              { name: "30 минут", price: 1500 },
              { name: "1 час", price: 2000 },
            ],
          },
          {
            name: "Выходные дни",
            subname: [
              { name: "30 минут", price: 1500 },
              { name: "1 час", price: 2000 },
            ],
          },
        ],
        stickers: [
          "При предварительной записи скидка 200 руб.",
          "Для всадников без опыта",
        ],
      },
    ],
  },
  {
    id: "group",
    groupName: "Групповые занятия на лошадях (пони)",
    services: [
      {
        name: "1-й уровень подготовки",
        description:
          "Группы для начинающих, оздоровительные группы. 5-12 всадников",
        image: "/images/services/group1.jpg",
        subname: [
          {
            name: "4 занятия в месяц",
            subname: [
              { name: "Будние дни", price: 6000 },
              { name: "Выходные дни", price: 8000 },
            ],
          },
          { name: "8 занятий в месяц", price: 10000 },
          { name: "12 занятий в месяц", price: 15000 },
        ],
      },
      {
        name: "2-й уровень подготовки",
        description:
          "Конкур, выездка. Спортивная подготовка с возможностью участия в соревнованиях в клубе, участие в показательных выступлениях. Не более 10 всадников в группе",
        image: "/images/services/group2.jpg",
        subname: [{ name: "8 занятий в месяц", price: 15000 }],
      },
    ],
  },
  {
    id: "rent",
    groupName: "Аренда лошадей и пони для спортивных занятий",
    services: [
      {
        name: "Полная аренда лошади (пони)",
        description: "6 дней в неделю",
        subname: [
          { name: "аренда лошади", price: 25000 },
          { name: "тренер", price: 8000 },
          { name: "тренер-берейтор", price: 10000 },
          {
            name: "тренер-берейтор с сопровождением на соревнованиях",
            price: 15000,
          },
          { name: "коновод", price: 5000 },
        ],
      },
      {
        name: "Половина аренды лошади (пони)",
        description: "3 дня в неделю",
        subname: [
          { name: "аренда лошади", price: 18000 },
          { name: "тренер", price: 6000 },
          { name: "тренер-берейтор", price: 7000 },
          {
            name: "тренер-берейтор с сопровождением на соревнованиях",
            price: 8000,
          },
          { name: "коновод", price: 3000 },
        ],
      },
      {
        name: "Разовая аренда лошади (пони)",
        description: "Для выезда на соревнования",
        subname: [
          {
            name: "Аренда лошади (пони)",
            description: "цена за один старт",
            subname: [
              { name: "в клубе", price: 1000 },
              { name: "на выезде", price: 3000 },
            ],
          },
          {
            name: "Тренер",
            description: "цена за одну лошадь",
            subname: [
              { name: "в клубе", price: 500 },
              { name: "на выезде", price: 1000 },
            ],
          },
          {
            name: "Коновод",
            description: "цена за одну лошадь",
            subname: [
              { name: "в клубе", price: 500 },
              { name: "на выезде", price: 1000 },
            ],
          },
        ],
      },
    ],
  },
];

export default services_bd;
