export default function EquestrianHorse() {
  return (
    <div>
      <h1 className="text-5xl mb-2.5">Пони-клуб</h1>
      <div>
        <p className="mb-2.5">
          Ваш ребенок обожает лошадей? Каждый раз, видя лошадку на улице или в
          парке, просит его прокатить? Вы хотите приобщить Вашего ребенка к
          верховой езде, но опасаетесь допускать его к лошади? К Вашим услугам
          наш Пони-клуб.
        </p>
        <p className="mb-2.5">
          Мы предлагаем Вашему малышу познакомиться с нашими смешными,
          пушистыми, разноцветными пони. Их можно гладить, кормить и, конечно,
          кататься. Пони-клуб – это гордость и надежды нашей организации.
        </p>
        <p className="mb-2.5">
          После создания Пони-клуба, КСК «Александрова Дача» практически
          превратился в семейный центр досуга: родители, переживающие за успехи
          своих детей, младшие братья и сестренки, проводящие время на детской
          мини-площадке и пока только знакомящиеся с пони и другими животными
          клуба, и непосредственно наши юные спортсмены.
        </p>
        <p className="mb-2.5">
          Занятия по обучению верховой езде на пони рассчитаны на детей от 4-х
          лет. Если Ваш малыш младше, можно просто привести его в наш клуб
          просто покататься или пообщаться с пони, лошадками, маленькими
          жеребятами, верблюдами, оленями, козочками и другими животными нашего
          клуба.
        </p>
        <p className="mb-2.5">
          До 6 лет занятия возможны только в индивидуальном порядке, после 6 лет
          можно продолжить заниматься индивидуально или в группе. Занятия в
          пони-клубе развивают в ребенке такие качества как уверенность,
          настойчивость, выносливость, самостоятельность, трудолюбие. У ребенка
          исправляется осанка, а занятия на свежем воздухе укрепляют здоровье.
        </p>
        <p className="mb-2.5">
          Форма одежды для разовых занятий (катаний) - спортивные штаны, обувь
          на гладкой подошве с невысоким (1-3 см) каблуком, и, по-возможности, с
          высоким голенищем. Запрещена обувь с рифлёной подошвой и липучками,
          кроссовки, туфли и т.п.
        </p>
        <p className="mb-2.5">Защитный шлем выдается клубом.</p>
        <h2>Для начинающих всадников:</h2>
        <p className="mb-2.5">
          Чтобы стать членом клуба и заниматься постоянно требуется заявление от
          родителей, медицинская справка об отсутствии противопоказаний занятий
          конным спортом.
        </p>
        <p className="mb-2.5">
          Также в специальных конных магазинах необходимо приобрести шлем,
          хлыст, крючок для чистки копыт, щетку, скребницу, краги или сапоги для
          верховой езды.
        </p>
        <p className="mb-2.5">
          Все занятия происходят в легкой игровой форме, индивидуально или в
          группах по 4-6 человек под присмотром опытных инструкторов и финансово
          доступны практически каждой семье.
        </p>
        <p className="mb-2.5">
          На первых занятиях ребенок учится чистить, седлать пони, приводить в
          порядок гриву и хвост, очищать от грязи копыта специальным крючком,
          знакомится с техникой безопасности при обращении с лошадью, учится
          ездить шагом и рысью.
        </p>
        <p className="mb-2.5">
          В дальнейшем из начинающих всадников формируются смены, которые
          занимаются по абонементу, один или два раза в неделю. На занятиях дети
          учатся элементам верховой езды (вольт, серпантин, диагональ и т.д.),
          выполняют физические упражнения. Часто проводятся веселые игры и
          эстафеты.
        </p>
        <p className="mb-2.5">
          Для детей, занимающихся в группах 1 уровня подготовки, клуб на своей
          базе проводит соревнования «для начинающих». Регулярно проводятся
          конкурсы детского и семейного рисунка, создаются стенгазеты о жизни
          клуба. Ко всем праздникам (Новый год, Рождество, 23 февраля, 8 марта и
          т.д.) клуб готовит веселые мероприятия для всех членов клуба: дети и
          родители участвуют в конных «веселых стартах», показательных
          выступлениях, костюмированных постановках. Как правило, почетными
          гостями таких мероприятий становятся официальные лица районной
          администрации.
        </p>
        <p className="mb-2.5">
          Пони-спорт официально был признан видом спортом в 2009 году. В России
          пони-спорт набирает свою популярность.
        </p>
        <p className="mb-2.5">
          Существуют два вида соревнований по пони-спорту: выездка и конкур.
        </p>
        <p className="mb-2.5">
          Выездка показывает умение управлять лошадью, выполнять различные
          элементы: вольты, диагонали, серпантин, остановка, переход из аллюра в
          аллюр. Нередко проводятся костюмированные выездки (КЮР). Фантазия
          детей и родителей по изготовлению костюмов не имеет предела. На таких
          соревнованиях Вы сможете увидеть верхом на пони мушкетера, гусара,
          золотую рыбку, жар-птицу, царевну-лебедь, шамаханскую царицу,
          привидение и многих других персонажей.
        </p>
        <p className="mb-2.5">
          Соревнования по конкуру — это преодоление на пони барьеров различной
          высоты, от лежащих на земле палочек (кавалетти) до барьеров высотой 80
          см. В конкуре на стиль всадника оценивается правильность посадки
          всадника, равномерность движения по маршруту, прямолинейность захода
          на барьер, умение пользоваться средствами управления. Соревнования по
          конкуру на чистоту и резвость подразумевают прохождение маршрута без
          ошибок за кратчайшее время. На таких соревнованиях детям присваиваются
          категории по конному спорту.
        </p>
        <p className="mb-2.5">
          Наши юные всадники участвуют в соревнованиях, проводимых как в нашем
          клубе, так и в других клубах Санкт-Петербурга и Ленинградской области.
          Неоднократно занимали призовые места в личных и командных зачетах.
        </p>
        <p className="mb-2.5">
          Ежегодно наши спортсмены успешно представляют КСК «Александрова Дача»
          в Москве на чемпионате России среди пони-клубов.
        </p>
        <p className="mb-2.5">
          Для достижения более высоких спортивных результатов рекомендуем взять
          пони в аренду. Мы поможем подобрать Вашему ребенку пони,
          соответствующую его возможностям и намерениям.
        </p>
      </div>
    </div>
  );
}
